# Comments Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSynchronizingWithCentralEventArgs..::..Comments Property
DocumentSynchronizingWithCentralEventArgs Class See Also
---
User's comments for synchronization.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public string Comments { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Comments As String
	Get
```

Visual C++
---
```text
public:
property String^ Comments {
	String^ get ();
}
```

# See Also
DocumentSynchronizingWithCentralEventArgs Class
Autodesk.Revit.DB.Events Namespace